In [186]:
import os
import pandas as pd             # библиотека для анализа данных
import sqlite3                  # подключение к базе данных SQLite3        
import matplotlib.pyplot as plt # построение графиков
import numpy as np

# Текущая директория
ROOT_PATH = os.path.abspath(os.curdir)

%matplotlib inline

# Pandas series

In [187]:
# создание серии 1 - список
my_series = pd.Series([5, 6, 7, 8, 9, 10])
# my_series

# создание серии 2 - словарь
my_series2 = pd.Series({'a':5, 'b':6, 'c':7, 'd':8, 'e':9, 'f':10})
my_series2

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [188]:
# индексы
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [189]:
# значения элементов
print(my_series.values) # все
print(my_series.values[1])  # второй элемент
my_series.values

[ 5  6  7  8  9 10]
6

array([ 5,  6,  7,  8,  9, 10], dtype=int64)

In [190]:
# свои индексы
my_series1 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])
my_series1

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [191]:
# индексы
my_series1.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [192]:
# обращение к элементам
my_series[[4]]

4    9
dtype: int64

In [193]:
# обращение к элементам
my_series1[['a']]

a    5
dtype: int64

In [194]:
# замена значения по индексу
my_series1[['a', 'b', 'e']] = 0
my_series1

a     0
b     0
c     7
d     8
e     0
f    10
dtype: int64

In [195]:
# вывод по условию
my_series1[my_series1 > 0]

c     7
d     8
f    10
dtype: int64

In [196]:
#
my_series2.name = 'numbers'
my_series2.index.name = 'letters'
my_series2

letters
a     5
b     6
c     7
d     8
e     9
f    10
Name: numbers, dtype: int64

# Pandas DataFrame

In [197]:
# создание datframe
df = pd.DataFrame({
    'country':['Казахстан', 'Россия', 'Беларуссия', 'Украина'],
    'population':[17.04, 143.5, 9.5, 45.5],
    'square':[2724902, 171251191, 207600, 603628]
})
df

      country  population     square
0   Казахстан       17.04    2724902
1      Россия      143.50  171251191
2  Беларуссия        9.50     207600
3     Украина       45.50     603628

In [198]:
# вывод значений колонки 'population' 
df.population

0     17.04
1    143.50
2      9.50
3     45.50
Name: population, dtype: float64

In [199]:
# тип значений колонки 'population' 
type(df.population)

pandas.core.series.Series

In [200]:
# новые индексы
df.index = ['KZ', 'RU', 'BY', 'UA']
df

       country  population     square
KZ   Казахстан       17.04    2724902
RU      Россия      143.50  171251191
BY  Беларуссия        9.50     207600
UA     Украина       45.50     603628

## Импорт данных:

In [201]:
# импорт из CSV
ml = pd.read_csv(os.path.join(ROOT_PATH, 'meteorite-landings.csv'), sep=',')
ml

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.037,17.018,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.783,8.967,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.250,17.667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.789,41.505,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.983,-115.683,"(33.983330, -115.683330)"

In [202]:
# пять первых
ml.head

<bound method NDFrame.head of              name     id nametype              recclass      mass   fall  \
0          Aachen      1    Valid                    L5      21.0   Fell
1          Aarhus      2    Valid                    H6     720.0   Fell
2            Abee      6    Valid                   EH4  107000.0   Fell
3        Acapulco     10    Valid           Acapulcoite    1914.0   Fell
4         Achiras    370    Valid                    L6     780.0   Fell
...           ...    ...      ...                   ...       ...    ...
45711  Zillah 002  31356    Valid               Eucrite     172.0  Found
45712      Zinder  30409    Valid  Pallasite, ungrouped      46.0  Found
45713        Zlin  30410    Valid                    H4       3.3  Found
45714   Zubkovsky  31357    Valid                    L6    2167.0  Found
45715  Zulu Queen  30414    Valid                  L3.7     200.0  Found

         year  reclat  reclong               GeoLocation
0      1880.0  50.775    6.083     (50.775000, 6.083330)
1      1951.0  56.183   10.233    (56.183330, 10.233330)
2      1952.0  54.217 -113.000  (54.216670, -113.000000)
3      1976.0  16.883  -99.900   (16.883330, -99.900000)
4      1902.0 -33.167  -64.950  (-33.166670, -64.950000)
...       ...     ...      ...                       ...
45711  1990.0  29.037   17.018    (29.037000, 17.018500)
45712  1999.0  13.783    8.967     (13.783330, 8.966670)
45713  1939.0  49.250   17.667    (49.250000, 17.666670)
45714  2003.0  49.789   41.505    (49.789170, 41.504600)
45715  1976.0  33.983 -115.683  (33.983330, -115.683330)

[45716 rows x 10 columns]>

In [203]:
# пять последних
ml.tail

<bound method NDFrame.tail of              name     id nametype              recclass      mass   fall  \
0          Aachen      1    Valid                    L5      21.0   Fell
1          Aarhus      2    Valid                    H6     720.0   Fell
2            Abee      6    Valid                   EH4  107000.0   Fell
3        Acapulco     10    Valid           Acapulcoite    1914.0   Fell
4         Achiras    370    Valid                    L6     780.0   Fell
...           ...    ...      ...                   ...       ...    ...
45711  Zillah 002  31356    Valid               Eucrite     172.0  Found
45712      Zinder  30409    Valid  Pallasite, ungrouped      46.0  Found
45713        Zlin  30410    Valid                    H4       3.3  Found
45714   Zubkovsky  31357    Valid                    L6    2167.0  Found
45715  Zulu Queen  30414    Valid                  L3.7     200.0  Found

         year  reclat  reclong               GeoLocation
0      1880.0  50.775    6.083     (50.775000, 6.083330)
1      1951.0  56.183   10.233    (56.183330, 10.233330)
2      1952.0  54.217 -113.000  (54.216670, -113.000000)
3      1976.0  16.883  -99.900   (16.883330, -99.900000)
4      1902.0 -33.167  -64.950  (-33.166670, -64.950000)
...       ...     ...      ...                       ...
45711  1990.0  29.037   17.018    (29.037000, 17.018500)
45712  1999.0  13.783    8.967     (13.783330, 8.966670)
45713  1939.0  49.250   17.667    (49.250000, 17.666670)
45714  2003.0  49.789   41.505    (49.789170, 41.504600)
45715  1976.0  33.983 -115.683  (33.983330, -115.683330)

[45716 rows x 10 columns]>

In [204]:
mailru = pd.read_html('https://mail.ru/')
mailru

[                                                   0                1
 0  Mail.ruПочтаМой МирОдноклассникиИгрыЗнакомства...  РегистрацияВход,
     0      1
 0 NaN  выход,
                  0
 0  РегистрацияВход,
          0      1     2     3     4     5        6
 0  Новости  Спорт  Авто  Кино  Леди  Игры  Hi-Tech,
                                                    0  \
 0  Погода-1, днем +7завтра +9mr.counter('d1265489');

                                                    1  \
 0  Курс ЦБ c 03.10$78.09+0.81€91.58+0.85mr.counte...

                                                    2
 0  ГороскопыВесы — прислушивайтесь к интуиции. Он...  ,
               0                                        1  \
 0  ТВ программа  Нефть39.23−1.67mr.counter('d12403154');

                              2
 0  Начните делать добрые дела!  ,
              0                      1
 0  ЭрудитБалда  Покер на костяхДомино,
                          0                       1
 0  Клиентские39Мини-игры68  Браузерные100Новинки25]

#### Работа Pandas с большими файлами, которые непомещаются в память. Можно читать небольшими чанками.

In [205]:
# чанк
c_size = 10000

# считывание в цикле
for gm_chunk in pd.read_csv(os.path.join(ROOT_PATH, 'meteorite-landings.csv'), sep=',', chunksize=c_size):
    print(gm_chunk.shape)

(10000, 10)
(10000, 10)
(10000, 10)
(10000, 10)
(5716, 10)

# Экспорт данных:

In [206]:
# pd.to_csv(filename)
# pd.to_sql(tablename, connection_object)
# и т.д.

## Доступ к данным:

- .loc - доступ по строковой метке
- .iloc - доступ по числовому значению (с 0)

In [207]:
df

       country  population     square
KZ   Казахстан       17.04    2724902
RU      Россия      143.50  171251191
BY  Беларуссия        9.50     207600
UA     Украина       45.50     603628

In [208]:
df.loc['KZ']

country       Казахстан
population           17
square          2724902
Name: KZ, dtype: object

In [209]:
df.iloc[0]

country       Казахстан
population           17
square          2724902
Name: KZ, dtype: object

In [210]:
# индекс + колонка
df.loc[['KZ', 'RU'], 'population']

KZ     17.04
RU    143.50
Name: population, dtype: float64

In [211]:
df.iloc[[0, 1], 1]

KZ     17.04
RU    143.50
Name: population, dtype: float64

In [212]:
df[df.population > 10][['country', 'square']]

      country     square
KZ  Казахстан    2724902
RU     Россия  171251191
UA    Украина     603628

In [213]:
df[(df.square > 70000) & (df.country == 'Россия')][['country', 'square']]

   country     square
RU  Россия  171251191

In [214]:
# Или так
filter = (df.country == 'Россия')
df[filter]

   country  population     square
RU  Россия       143.5  171251191

In [215]:
df.population > 10

KZ     True
RU     True
BY    False
UA     True
Name: population, dtype: bool

In [216]:
# создадим новую колонку
df['density'] = df['population'] / df['square'] * 1000000
df

       country  population     square  density
KZ   Казахстан       17.04    2724902    6.253
RU      Россия      143.50  171251191    0.838
BY  Беларуссия        9.50     207600   45.761
UA     Украина       45.50     603628   75.378

In [217]:
# df.drop(['density'], axis=1)
# # результат вывода неизменится
# df


# для перезаписи df надо сделать так
df.drop(['density'], axis='columns', inplace=True)
# inplace=True - перезапись (подмена) исходного df
df

       country  population     square
KZ   Казахстан       17.04    2724902
RU      Россия      143.50  171251191
BY  Беларуссия        9.50     207600
UA     Украина       45.50     603628

In [218]:
# переименование колонки
df = df.rename(columns={"Country_Code":"country_code"})
df

       country  population     square
KZ   Казахстан       17.04    2724902
RU      Россия      143.50  171251191
BY  Беларуссия        9.50     207600
UA     Украина       45.50     603628

In [219]:
# 2а наибольших значения из колонки "population"
df = df.nlargest(2, "population")
df

    country  population     square
RU   Россия       143.5  171251191
UA  Украина        45.5     603628

## Работа с данными:
Источник: meteorite-landings.csv - падения метиоритов

In [220]:
# импорт данных из CSV
df = pd.read_csv(os.path.join(ROOT_PATH, 'meteorite-landings.csv'), sep=',')

In [221]:
# просмотр данных (первые строки)
df.head()
# df.tail()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"

- По умолчанию выводятся 20 колонок и 60 строк

In [222]:
# меняем их
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 200)
# кол-во знаков после запятой (округление)
pd.set_option('display.precision', 3)

In [223]:
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"

In [224]:
# строки, колонки 
df.shape

(45716, 10)

In [225]:
# индексы
df.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

### Общая информация по выборке

In [226]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

занимаемая память критичный параметр

In [227]:
# числовые значения float64
df.describe()

              id       mass       year     reclat    reclong
count  45716.000  4.558e+04  45428.000  38401.000  38401.000
mean   26889.735  1.328e+04   1991.772    -39.123     61.074
std    16860.683  5.750e+05     27.181     46.379     80.647
min        1.000  0.000e+00    301.000    -87.367   -165.433
25%    12688.750  7.200e+00   1987.000    -76.714      0.000
50%    24261.500  3.260e+01   1998.000    -71.500     35.667
75%    40656.750  2.026e+02   2003.000      0.000    157.167
max    57458.000  6.000e+07   2501.000     81.167    354.473

In [228]:
# числовые значения float64
df.describe(include=['float64'])

            mass       year     reclat    reclong
count  4.558e+04  45428.000  38401.000  38401.000
mean   1.328e+04   1991.772    -39.123     61.074
std    5.750e+05     27.181     46.379     80.647
min    0.000e+00    301.000    -87.367   -165.433
25%    7.200e+00   1987.000    -76.714      0.000
50%    3.260e+01   1998.000    -71.500     35.667
75%    2.026e+02   2003.000      0.000    157.167
max    6.000e+07   2501.000     81.167    354.473

In [229]:
# не числовые (категориальные) значения (признаки) - object
df.describe(include=['object'])

                        name nametype recclass   fall           GeoLocation
count                  45716    45716    45716  45716                 38401
unique                 45716        2      466      2                 17100
top     LaPaz Icefield 04657    Valid       L6  Found  (0.000000, 0.000000)
freq                       1    45641     8285  44609                  6214

In [230]:
# 5 самых встречающихся признаков в колонке 'recclass'
df.recclass.value_counts()[:5]

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

In [231]:
# сколько каждый тип в среднем занимает памяти
for dtype in ['float', 'int', 'object']:
    # возвращаем подмножество столбцов DataFrame на основе dtypes столбцов
    select_dtype = df.select_dtypes(include=[dtype])
    # Возвращаем использование памяти каждого столбца в байтах. means()-среднее значение по выборке 
    mean_usege_b = select_dtype.memory_usage(deep=True).mean()
    # байты в мегабайты
    mean_usege_mb = mean_usege_b / 1024 ** 2
    print("Avaridg memory usege for {} columns: {:03.2f} MB".format(dtype, mean_usege_mb))

Avaridg memory usege for float columns: 0.28 MB
Avaridg memory usege for int columns: 0.00 MB
Avaridg memory usege for object columns: 2.41 MB

Можно закодировать колонки типа 'object' в числовые эквиваленты 
(LabelEncoder или OneHotEncoder). 
Линейные модели, метрики близости объектов, линейные регрессии НЕРАБОТАЮТ.
OneHotEncoder - преобразует данные в разреженную матрицу -> 
Линейные модели, метрики близости объектов, линейные регрессии РАБОТАЮТ.

In [232]:
# для сокращения объема используемой памяти можно преобразовать колонки float64 в float32
df['mass'] = df['mass'].astype('float32')

In [233]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float32(1), float64(3), int64(1), object(5)
memory usage: 3.3+ MB

## Тип данных КАТЕГОРИЯ

In [234]:
# количество уникальных значений 
[(col, df[col].nunique()) for col in df.columns]

[('name', 45716),
 ('id', 45716),
 ('nametype', 2),
 ('recclass', 466),
 ('mass', 12576),
 ('fall', 2),
 ('year', 268),
 ('reclat', 12738),
 ('reclong', 14640),
 ('GeoLocation', 17100)]

In [235]:
# глубокая копия -> новый df
df_with_cat = df.copy()

In [236]:
# преобразуем recclass в categiry - тип category
df_with_cat['recclass'] = df_with_cat['recclass'].astype('category')

In [237]:
df_with_cat.info()
# сокращение объема используемой памяти

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  category
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: category(1), float32(1), float64(3), int64(1), object(4)
memory usage: 3.1+ MB

In [238]:
%%timeit
# вычисление времени выполнения команды по df с категориальной колонкой
df_with_cat.groupby('recclass')['mass'].mean().to_frame()

1.01 ms ± 24.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [239]:
%%timeit
# вычисление времени выполнения команды по df без категориальной колонкой
df.groupby('recclass')['mass'].mean().to_frame()

2.76 ms ± 92.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

### Применение к данным требуемых операций

In [240]:
# сортировка по возрастанию ascending=[True, False] [1я колонка, 2я колонка]
df.sort_values(by=['recclass', 'mass'], ascending=[True, False]).head(3)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
27673,Northwest Africa 2656,32485,Valid,Acapulcoite,7500.0,Found,2003.0,NaN,NaN,NaN
30353,Northwest Africa 725,17807,Valid,Acapulcoite,3824.0,Found,NaN,30.6,-5.05,"(30.600000, -5.050000)"
27845,Northwest Africa 2871,33345,Valid,Acapulcoite,3467.0,Found,2005.0,NaN,NaN,NaN

In [241]:
# извлечение 6-ти строк
df.loc[0:5,:]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.100,71.800,"(32.100000, 71.800000)"

In [242]:
# средняя масса по имени (условие > колонка > функция)
df[df["name"] == 'Abee']["mass"].mean()

107000.0

In [243]:
# количество уникальных значений в колонке 'fall'
#df.fall.value_counts()
# количество уникальных значений в колонке 'fall' с NaN или без
df.fall.value_counts(dropna=False)

Found    44609
Fell      1107
Name: fall, dtype: int64

In [244]:
# применение функции к колонке/строке
df[['mass', 'id']].apply(np.max)

mass    6.000e+07
id      5.746e+04
dtype: float64

In [245]:
# добавим новую колонку со значениями (1, 0) в соответствии с другой колонкой 
d = {"Found": 1, "Fell": 0}
df["status"] = df["fall"].map(d)
df.tail

<bound method NDFrame.tail of              name     id nametype              recclass      mass   fall  \
0          Aachen      1    Valid                    L5      21.0   Fell
1          Aarhus      2    Valid                    H6     720.0   Fell
2            Abee      6    Valid                   EH4  107000.0   Fell
3        Acapulco     10    Valid           Acapulcoite    1914.0   Fell
4         Achiras    370    Valid                    L6     780.0   Fell
...           ...    ...      ...                   ...       ...    ...
45711  Zillah 002  31356    Valid               Eucrite     172.0  Found
45712      Zinder  30409    Valid  Pallasite, ungrouped      46.0  Found
45713        Zlin  30410    Valid                    H4       3.3  Found
45714   Zubkovsky  31357    Valid                    L6    2167.0  Found
45715  Zulu Queen  30414    Valid                  L3.7     200.0  Found

         year  reclat  reclong               GeoLocation  status
0      1880.0  50.775    6.083     (50.775000, 6.083330)       0
1      1951.0  56.183   10.233    (56.183330, 10.233330)       0
2      1952.0  54.217 -113.000  (54.216670, -113.000000)       0
3      1976.0  16.883  -99.900   (16.883330, -99.900000)       0
4      1902.0 -33.167  -64.950  (-33.166670, -64.950000)       0
...       ...     ...      ...                       ...     ...
45711  1990.0  29.037   17.018    (29.037000, 17.018500)       1
45712  1999.0  13.783    8.967     (13.783330, 8.966670)       1
45713  1939.0  49.250   17.667    (49.250000, 17.666670)       1
45714  2003.0  49.789   41.505    (49.789170, 41.504600)       1
45715  1976.0  33.983 -115.683  (33.983330, -115.683330)       1

[45716 rows x 11 columns]>

In [246]:
# максимальное значение по колонке 'mass' для групп по колонке 'fall'
df.groupby(by="fall")["mass"].max()

fall
Fell     2.300e+07
Found    6.000e+07
Name: mass, dtype: float32

In [247]:
# статистические данные по колонке 'mass' для групп объектов 'fall'
df.groupby(by="fall")["mass"].agg([np.mean, np.std, np.min, np.max])

            mean         std  amin       amax
fall
Fell   47070.715  717067.126   0.1  2.300e+07
Found  12461.923  571105.752   0.0  6.000e+07

In [248]:
# сводные таблици пересечение
pd.crosstab(df["fall"], df["nametype"])

nametype  Relict  Valid
fall
Fell           0   1107
Found         75  44534

In [249]:
# сводные таблици пересечение, нормализованная статистика (значение делённое на количество наблюдений)
pd.crosstab(df["fall"], df["nametype"], normalize=True)

nametype  Relict  Valid
fall
Fell       0.000  0.024
Found      0.002  0.974

## Marge, join and concatinate
Документация - https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [267]:
# 1я таблица
raw_data = {
    "subject_id": ['1', '2', '3', '4', '5'],
    "first_name": ['Alex', 'Any', 'Allen', 'Alice', 'Ayoung'],
    "last_name": ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
    }
df_a = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_a.index = [0, 1, 2, 3, 4]
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [268]:
# 2я таблица
raw_data = {
    "subject_id": ['4', '5', '6', '7', '8'],
    "first_name": ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    "last_name": ['Bonder', 'Black', 'Baiwner', 'Brice', 'Btisan']
    }
df_b = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_b.index = [2, 3, 4, 5, 6]
df_b

  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [269]:
df_b.reset_index()
df_b

  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [270]:
# 3я таблица
raw_data = {
    "subject_id": ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
    "test_id": [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
    }
df_n = pd.DataFrame(raw_data, columns=["subject_id", "test_id"])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

## Concat
объединение по вертикальной или горизонтальной оси

In [274]:
# строки
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [275]:
# колонки (строки содержащие NaN - т.к. разные индексы в объединяемых таблицах)
df_new_ = pd.concat([df_a, df_b], axis=1)
df_new_

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson        NaN        NaN       NaN
1          2        Any  Ackerman        NaN        NaN       NaN
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Baiwner
5        NaN        NaN       NaN          7      Bryce     Brice
6        NaN        NaN       NaN          8      Betty    Btisan

In [276]:
# выравниваем индексы в объединяемых таблицах (dtop - сохранить или удалить старый индекс)
df_a1 = df_a
df_b1 = df_b
# print(df_a1)
print(df_b1)
df_b1.reset_index(inplace=True)
print(df_b1)
df_new_ = pd.concat([df_a1, df_b1], axis=1)
df_new_

  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan
   index subject_id first_name last_name
0      2          4      Billy    Bonder
1      3          5      Brian     Black
2      4          6       Bran   Baiwner
3      5          7      Bryce     Brice
4      6          8      Betty    Btisan

  subject_id first_name last_name  index subject_id first_name last_name
0          1       Alex  Anderson      2          4      Billy    Bonder
1          2        Any  Ackerman      3          5      Brian     Black
2          3      Allen       Ali      4          6       Bran   Baiwner
3          4      Alice      Aoni      5          7      Bryce     Brice
4          5     Ayoung   Atiches      6          8      Betty    Btisan

In [278]:
# 1я таблица
raw_data = {
    "subject_id": ['1', '2', '3', '4', '5'],
    "first_name": ['Alex', 'Any', 'Allen', 'Alice', 'Ayoung'],
    "last_name": ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
    }
df_a = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_a.index = [0, 1, 2, 3, 4]
# 2я таблица
raw_data = {
    "subject_id": ['4', '5', '6', '7', '8'],
    "first_name": ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    "last_name": ['Bonder', 'Black', 'Baiwner', 'Brice', 'Btisan']
    }
df_b = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_b.index = [2, 3, 4, 5, 6]

In [279]:
# результат объединения - только строки с одинаковыми индексами (Н-р: 1,2,3)
df_new_ = pd.concat([df_a, df_b], axis=1, join='inner')
print(df_a)
print(df_b)
df_new_

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

  subject_id first_name last_name subject_id first_name last_name
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Baiwner

## Apend
частный случай Concat - параметры: axis=0 - строки и join='outer'

In [282]:
# просто добавляем строки из df_b в df_a
df_c = df_a.append(df_b)
df_c

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

## Merge

In [283]:
df_c

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [284]:
# присоединяем строки df_n к df_с по совпадению 'subject_id' 
pd.merge(df_c, df_n, on='subject_id')
# или 
# pd.merge(df_c, df_n, left_on='subject_id', right_on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Any  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [285]:
# оставляем все значения правой таблици и добавляем значения из левой по индексу. 
# Если нет значения - NaN
print(df_a)
print(df_b)
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Any    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black

In [287]:
# Наоборот
# оставляем все значения левой таблици и добавляем значения из правой по индексу. 
# Если нет значения - NaN
print(df_a)
print(df_b)
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Baiwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan

In [288]:
print(df_a)
print(df_b)
pd.merge(df_a, df_b, right_index=True, left_index=True)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Any  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Baiwner
5          7      Bryce     Brice
6          8      Betty    Btisan

  subject_id_x first_name_x last_name_x subject_id_y first_name_y last_name_y
2            3        Allen         Ali            4        Billy      Bonder
3            4        Alice        Aoni            5        Brian       Black
4            5       Ayoung     Atiches            6         Bran     Baiwner

## The end